Sample API/EditClient_REQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsin="http://www.openwaygroup.com/wsint">
   <soapenv:Header>
      <wsin:SessionContextStr>?</wsin:SessionContextStr>
      <wsin:UserInfo>officer="WX_ADMIN"</wsin:UserInfo>
      <wsin:CorrelationId>?</wsin:CorrelationId>
   </soapenv:Header>
   <soapenv:Body>
      <wsin:EditClientV6>
         <wsin:ClientSearchMethod>CLIENT_NUMBER</wsin:ClientSearchMethod>
         <wsin:ClientIdentifier>099773245419</wsin:ClientIdentifier>
         <wsin:Reason>TO TEST</wsin:Reason>
         <wsin:EditClient_InObject>
            <!--Optional:-->
            <wsin:ShortName></wsin:ShortName>
            <!--Optional:-->
            <wsin:Gender></wsin:Gender>
            <!--Optional:-->
            <wsin:FirstName></wsin:FirstName>
            <!--Optional:-->
            <wsin:MiddleName></wsin:MiddleName>
            <!--Optional:-->
            <wsin:LastName></wsin:LastName>
            <!--Optional:-->
            <wsin:BirthDate></wsin:BirthDate>
            <!--Optional:-->
            <wsin:Citizenship></wsin:Citizenship>
            <!--Optional:-->
            <wsin:HomePhone></wsin:HomePhone>
            <!--Optional:-->
            <wsin:MobilePhone></wsin:MobilePhone>
            <!--Optional:-->
            <wsin:EMail></wsin:EMail>
            <!--Optional:-->
            <wsin:Country></wsin:Country>
            <!--Optional:-->
            <wsin:City></wsin:City>
            <!--Optional:-->
            <wsin:AddressLine1></wsin:AddressLine1>
            <!--Optional:-->
            <wsin:AddressLine2></wsin:AddressLine2>
            <!--Optional:-->
            <wsin:AddressLine3></wsin:AddressLine3>
            <!--Optional:-->
            <wsin:CompanyName></wsin:CompanyName>
            <!--Optional:-->
            <wsin:PositionCode></wsin:PositionCode>
            <!--Optional:-->
            <wsin:Profession>?</wsin:Profession>
            <!--Optional:-->
            <wsin:EmbossedLastName></wsin:EmbossedLastName>
            <!--Optional:-->
            <wsin:EmbossedFirstName></wsin:EmbossedFirstName>
            <!--Optional:-->
            <wsin:AddDate01></wsin:AddDate01>
            <!--Optional:-->
         </wsin:EditClient_InObject>
         <!--1 or more repetitions:-->
         <wsin:SetCustomData_InObject>
            <!--Optional:-->
            <wsin:AddInfoType></wsin:AddInfoType>
            <!--Optional:-->
            <wsin:RemoveTag></wsin:RemoveTag>
            <!--Optional:-->
            <wsin:TagName></wsin:TagName>
            <!--Optional:-->
            <wsin:TagValue></wsin:TagValue>
         </wsin:SetCustomData_InObject>
         <!--Optional:-->
      </wsin:EditClientV6>
   </soapenv:Body>
</soapenv:Envelope>